<center><h1><strong><font color="blue">E(V)DA 04 - Data Wrangling</font></strong></h1></center>

<img alt="" src="images/covers/cover_ui-n-taudata.jpg"/>

<center><h1><strong><font color="blue">Outline:</font></strong></h1></center>

* Pendahuluan Data Wrangling
* Hierarchical Indexing
* Combine and Merge
* Reshape & Pivot
* Group By
* Data Aggregation
* Apply
* Pivot & Cross-Tab

<center><h1><strong><font color="blue">Data Cleaning, Cleansing, Munging, Wrangling</font></strong></h1></center>

<img alt="" src="images/data cleaning ceansing wrangling munging preprocessing preparation.png"/>

<center><h1><strong><font color="blue">Data Cleaning VS Cleansing: Tidak selalu sama artinya</font></strong></h1></center>

* https://indica.nl/blog/2021/3/16/what-is-the-difference-between-data-cleansing-and-data-cleaning

<img alt="" src="images/data-cleaning-VS-cleansing.png"/>

<center><h1><strong><font color="blue"> Perjalanan Data </font></strong></h1></center>

<img alt="" src="images/Data-Stage.png"/>

Source: [1]

Saat mengamati Raw Data, tanyakan/fikirkan:
* What kinds of records are in the data?
* How are the record fields encoded?
* How does the data relate to your organization, to the kinds of operations you have, and to the other data you are already using?

<center><h1><strong><font color="blue"> Data Value Funnel </font></strong></h1></center>

<img alt="" src="images/Data-Value-Funnel.png"/>

When it comes to delivering production value from your data, there are two
critical points to consider. 
1. data can produce insights that are not useful to you and your business. These insights might not be actionable, or their potential impact might be too small to warrant a change in existing processes. A good strategy for mitigating this risk is to empower the people who know your business priorities to explore your data. 
2. your exploratory analytics efforts should be as efficient as possible. This brings us back to data wrangling. 

The faster you can wrangle data, the more explorations of your data you can conduct, and the more analyses you will be able to move into production. Ultimately, implementing an effective data
wrangling workflow can enable more business analysts to explore a larger quantity of data at a faster pace.

<center><h1><strong><font color="blue"> Perjalanan Data Diperjelas</font></strong></h1></center>

<img alt="" src="images/Data-Stage-detailed.png"/>

Setiap tahap ada proses utama

<center><h1><strong><font color="blue"> Data Wrangling adalah Proses yang Dinamis (Iteratif) </font></strong></h1></center>

<img alt="" src="images/Data-Wrangling-Dynamics.png"/>

<center><h1><strong><font color="blue"> Core data wrangling types </font></strong></h1></center>

<img alt="" src="images/Data-Wrangling-Types.png"/>

<center><h1><strong><font color="blue"> Profiling </font></strong></h1></center>

<img alt="" src="images/Data-wrangling-core-profiling.png"/>

<center><h1><strong><font color="blue"> Raw Data Stage </font></strong></h1></center>

<img alt="" src="images/Data-wrangling-Raw-Data-Stage.png"/>

* Bold artinya proses yang paling sering dilakukan (utama)

<center><h1><strong><font color="blue"> Refined Data Stage </font></strong></h1></center>

<img alt="" src="images/Data-wrangling-Refined-Data-Stage.png"/>

<center><h1><strong><font color="blue"> Production Data Stage </font></strong></h1></center>

<img alt="" src="images/Data-wrangling-Production-Data-Stage.png"/>

<center><h1><strong><font color="blue"> Tanggung Jawab Siapa dan dengan Kompetensi seperti apa?</font></strong></h1></center>

<img alt="" src="images/Data-Professionals-in-Data-Wrangling.png"/>

<center><h1><strong><font color="blue"> Hierarchical Indexing </font></strong></h1></center>

* Hierarchical indexing is an important feature of pandas that enables you to have multiple (two or more) index levels on an axis
* Source: [2]

<img alt="" src="images/Hierarchical-index-in-Pandas-dataframe.png"/>

In [1]:
import warnings; warnings.simplefilter('ignore')
import pandas as pd, numpy as np

'Done'

'Done'

In [2]:
data = pd.DataFrame(data=np.random.randn(9), 
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

            0
a 1  0.431774
  2 -0.533268
  3 -0.287080
b 1 -1.590661
  3 -0.230203
c 1  1.180376
  2  0.931197
d 2 -0.331515
  3  0.422127

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [4]:
data.loc['b']

          0
1 -1.590661
3 -0.230203

In [5]:
data.loc[['b', 'd']] # Perhatikan jumlah kurung siku!....

            0
b 1 -1.590661
  3 -0.230203
d 2 -0.331515
  3  0.422127

In [6]:
data.loc['b' : 'd'] # Perhatikan jumlah kurung siku!.... Saat slicing berbeda!.

            0
b 1 -1.590661
  3 -0.230203
c 1  1.180376
  2  0.931197
d 2 -0.331515
  3  0.422127

# Hati-hati ... pemanggilan index sedikit berbeda di "Series"

In [7]:
data2 = pd.Series(np.random.randn(9), 
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data2['b']

1   -1.157420
3   -1.308925
dtype: float64

In [8]:
data2.loc[:, 2] # HAti-hati ... ini error jika "data2" berupa Dataframe!...

a   -0.474407
c    0.145893
d   -1.364100
dtype: float64

<center><h1><strong><font color="blue"> Hierarchical Indexing untuk Apa?</font></strong></h1></center>

Hierarchical indexing plays an important role in reshaping data and group-based
operations like forming a pivot table. For example, you could rearrange the data into
a DataFrame using its unstack method

<img alt="" src="images/stack-unstack-in-Pandas-dataframe.png"/>

In [9]:
data

            0
a 1  0.431774
  2 -0.533268
  3 -0.287080
b 1 -1.590661
  3 -0.230203
c 1  1.180376
  2  0.931197
d 2 -0.331515
  3  0.422127

In [10]:
data.unstack()

          0
          1         2         3
a  0.431774 -0.533268 -0.287080
b -1.590661       NaN -0.230203
c  1.180376  0.931197       NaN
d       NaN -0.331515  0.422127

In [11]:
np.nan

nan

In [22]:
data.unstack().stack() # Perhatikan struktur datanya

            0
a 1 -1.561716
  2  0.998846
  3 -0.659595
b 1  1.650003
  3  0.181217
c 1 -0.930051
  2 -2.339199
d 2  0.340327
  3 -0.637178

In [24]:
data.unstack().shape, data.unstack().stack().shape # Bilamana ini berguna? ... coba difikirkan

((4, 3), (9, 1))

# Rename Index (for clarity)

In [14]:
data = np.arange(12).reshape((4, 3))
data

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [12]:
frame = pd.DataFrame(data,
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[['Ohio', 'Ohio', 'Colorado'],
    ['Green', 'Red', 'Green']])

frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [28]:
# Pahami kedua perintah ini sebagai perubahan property di Object "frame"! ... 
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [29]:
# Memilih Groups of Colums
# Sangat memudahkan EDA nantinya ==> Sudah bukan DA cupu lagi.
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

<center><h1><strong><font color="blue"> Reordering and Sorting Levels </font></strong></h1></center>

In [36]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [39]:
# Bisa juga diurutkan
frame.sort_index(level=1) # Ganti "1" dengan "0" untuk memahami operasi ini.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

<center><h1><strong><font color="blue"> Summary Statistics by Level </font></strong></h1></center>

In [15]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [40]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [41]:
frame.sum(level='color', axis=1) # Perhatikan beda syntax akibat pemilihan "key" index/kolom

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

<center><h1><strong><font color="blue"> Indexing with a DataFrameâ€™s columns </font></strong></h1></center>

## Pada data di dunia nyata anda akan sering membutuhkan ini

In [42]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
     'c': ['one', 'one', 'one', 'two', 'two',
     'two', 'two'],
     'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [44]:
frame2 = frame.set_index(['c', 'd']) # ==> Membuat index berdasarkan nilai dari kolom "c" dan "d"
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [45]:
frame.set_index(['c', 'd'], drop=False) # Kalau kita ingin c dan d tetap ada (not sure why u want this)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [47]:
# Reset Index biasanya dibutuhkan saat kita sudah banyak melakukan perubahan di DF-nya
# Atau selesai melakukan data PreProcessing/EDA
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

<center><h1><strong><font color="blue"> Combining and Merging Datasets </font></strong></h1></center>

<img alt="" src="images/join-in-Pandas-dataframe.png"/>

Ada 3 macam:
* pandas.merge connects rows in DataFrames based on one or more keys. This will be familiar to users of SQL or other relational databases, as it implements database join operations.
* pandas.concat concatenates or â€œstacksâ€ together objects along an axis.
* The combine_first instance method enables splicing together overlapping data to fill in missing values in one object with values from another.

<center><h1><strong><font color="blue"> Database-Style DataFrame Joins (Merge/Join) </font></strong></h1></center>

<img alt="" src="images/"/>

In [48]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
     'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [49]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
    'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

# many-to-one join

the data in df1 has multiple rows labeled a
and b, whereas df2 has only one row for each value in the key column. Calling merge
with these objects we obtain:

## Data Mana yang Hilang? Mengapa?

In [50]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

# Bagaimana jika nama kolom berbeda?

In [52]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [53]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
    'data2': range(3)})

df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [54]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

# Inner join

You may notice that the 'c' and 'd' values and associated data are missing from the
result. By default merge does an 'inner' join; the keys in the result are the intersecâ€
tion, or the common set found in both tables.

<img alt="" src="images/join-in-Pandas-dataframe.png"/>

# Outer Join

Other possible options are 'left', 'right', and 'outer'. The outer join takes the union of the keys, combining the
effect of applying both left and right joins:

In [55]:
pd.merge(df1, df2, how='outer') # Perhatikan outputnya.

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

# Many-to-many merges 

* well-defined, though not necessarily intuitive, behavior
* Many-to-many joins form the Cartesian product of the rows.

In [56]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
     'data1': range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [58]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
    'data2': range(5)})

df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [59]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

Since there were three
'b' rows in the left DataFrame and two in the right one, there are six 'b' rows in the
result. The join method only affects the distinct key values appearing in the result:

In [60]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

<center><h1><strong><font color="blue"> merge with multiple keys </font></strong></h1></center>

* When youâ€™re joining columns-on-columns, the indexes on the
passed DataFrame objects are discarded.

In [61]:
df1 = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
    'key2': ['one', 'two', 'one'],
    'lval': [1, 2, 3]})
df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [62]:
df2 = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
     'key2': ['one', 'one', 'one', 'two'],
     'rval': [4, 5, 6, 7]})
df2

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [64]:
pd.merge(df1, df2, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

# overlapping column names

* While you can address the overlap manually (Rename nama kolom), merge has a suffixes option for specifying strings to append to overlapping names in the left and right DataFrame objects

In [67]:
pd.merge(df1, df2, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [69]:
pd.merge(df1, df2, on='key1', suffixes=('_atu', '_dua'))

  key1 key2_atu  lval key2_dua  rval
0  foo      one     1      one     4
1  foo      one     1      one     5
2  foo      two     2      one     4
3  foo      two     2      one     5
4  bar      one     3      one     6
5  bar      one     3      two     7

<center><h1><strong><font color="blue"> Merging on Index </font></strong></h1></center>

In [73]:
df1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
    'value': range(6)})
df1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [76]:
df2 = pd.DataFrame({'group_val': [35, 7]}, index=['a', 'b'])
df2

   group_val
a         35
b          7

In [77]:
pd.merge(df1, df2, left_on='key', right_index=True)

  key  value  group_val
0   a      0         35
2   a      2         35
3   a      3         35
1   b      1          7
4   b      4          7

# Concatenating Along an Axis

In [78]:
# Kalau di Numpy
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [79]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [81]:
# Di Pandas  - Series
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [82]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [83]:
# Concat di DataFrame

df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [84]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
    columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [87]:
pd.concat([df1, df2], axis=1) # , keys=['level1', 'level2']
#Perhatikan indexnya

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

<center><h1><strong><font color="blue"> Data Aggregation and Group Operations </font></strong></h1></center>

<img alt="" src="images/Aggregrate-Groups-Pandas-dataframe.png"/>

* pandas provides a flexible groupby interface, enabling you to slice, dice, and summarize datasets in a natural way.
* Aggregation of time series data, a special use case of groupby, is referred to as resampling.

<center><h1><strong><font color="blue"> 1. GroupBy Mechanics </font></strong></h1></center>

<img alt="" src="images/Split-Apply-Combine-Pandas-dataframe.png"/>

* Hadley Wickham, an author of many popular packages for the R programming lanâ€
guage, coined the term split-apply-combine for describing group operations.

In [93]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.478689  1.485648
1    a  two -0.008028 -0.182179
2    b  one -0.441588 -0.734013
3    b  two -0.432856  0.035351
4    a  one  0.567371 -0.066825

In [94]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [95]:
grouped.mean()

key1
a   -0.306449
b   -0.437222
Name: data1, dtype: float64

In [96]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.455659
      two    -0.008028
b     one    -0.441588
      two    -0.432856
Name: data1, dtype: float64

In [97]:
means.unstack()

key2       one       two
key1
a    -0.455659 -0.008028
b    -0.441588 -0.432856

In [98]:
df

  key1 key2     data1     data2
0    a  one -1.478689  1.485648
1    a  two -0.008028 -0.182179
2    b  one -0.441588 -0.734013
3    b  two -0.432856  0.035351
4    a  one  0.567371 -0.066825

In [100]:
df.groupby('key1').mean()

# You may have noticed in the first case df.groupby('key1').mean() that there is no key2 column in the result. 
# Because df['key2'] is not numeric data, it is said to be a nuisance column, which is therefore excluded from the result.

         data1     data2
key1
a    -0.306449  0.412215
b    -0.437222 -0.349331

In [101]:
# Walau pada data numerik terkadang kita ingin mengetahui jumlah kejadiannya (frekuensi)
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

# Iterating Over Groups

In [102]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.478689  1.485648
1    a  two -0.008028 -0.182179
4    a  one  0.567371 -0.066825
b
  key1 key2     data1     data2
2    b  one -0.441588 -0.734013
3    b  two -0.432856  0.035351

In [103]:
# Atau kalau mau bisa juga disimpan ke variable:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one -0.441588 -0.734013
3    b  two -0.432856  0.035351

# Selecting a Column or Subset of Columns

### Trivial sebenarnya

In [104]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.709412
     two  -0.182179
b    one  -0.734013
     two   0.035351

# GroupBy bisa flexible dengan memilih grouping berdasarkan kolom mana saja

* Sekalian rename hasil groupBy-nya

In [105]:
people = pd.DataFrame(np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     0.328770  0.138894  3.736735 -0.676019  0.681354
Steve  -0.127511 -0.807592  1.090983 -0.759185  0.397410
Wes     0.888059 -1.212781  0.559054  0.764838  1.290046
Jim     0.941923  1.004794  0.895026  0.327573  1.376999
Travis  0.139922  2.527273 -1.517072  0.912529  0.836937

In [106]:
GroupMap = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}
GroupMap

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [109]:
people.groupby(GroupMap, axis=1).sum()

            blue       red
Joe     3.060716  1.149018
Steve   0.331798 -0.537693
Wes     1.323892  0.965324
Jim     1.222600  3.323716
Travis -0.604543  3.504133

<center><h1><strong><font color="blue"> Data Aggregation </font></strong></h1></center>

<img alt="" src="images/GroupBy-Pandas-dataframe.png"/>

* Aggregations refer to any data transformation that produces scalar values from
arrays. 
* Tidak hanya fungsi yang ditabel diatas

In [110]:
df

  key1 key2     data1     data2
0    a  one -1.478689  1.485648
1    a  two -0.008028 -0.182179
2    b  one -0.441588 -0.734013
3    b  two -0.432856  0.035351
4    a  one  0.567371 -0.066825

In [111]:
df.groupby('key1').quantile(0.9)

         data1     data2
key1
a     0.452291  1.175153
b    -0.433729 -0.041586

# Custom Aggregate Function 

### Perhatikan, ini sangat penting untuk diketahui

In [114]:
def RangeData(arr):
    return arr.max() - arr.min()

In [115]:
df.groupby('key1').agg(RangeData)

         data1     data2
key1
a     2.046060  1.667827
b     0.008731  0.769364

# Apply di Dataframe

* Sangat penting juga untuk mengefisienkan Code

In [122]:
def sum_kuadrat(x):
    return x.sum()**2

data = {
  "x": [5, 4, 3],
  "y": [2, 1, 7]
}
df = pd.DataFrame(data)
df

   x  y
0  5  2
1  4  1
2  3  7

In [123]:
df.apply(sum_kuadrat)

x    144
y    100
dtype: int64

<center><h1><strong><font color="blue"> Pivot Tables and Cross-Tabulation </font></strong></h1></center>

A pivot table is a data summarization tool frequently found in spreadsheet programs
and other data analysis software. It aggregates a table of data by one or more keys,
arranging the data in a rectangle with some of the group keys along the rows and
some along the columns. Pivot tables in Python with pandas are made possible
through the groupby

In [124]:
import seaborn as sns

tips = sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [125]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip  total_bill
day  smoker
Thur Yes     2.352941  3.030000   19.190588
     No      2.488889  2.673778   17.113111
Fri  Yes     2.066667  2.714000   16.813333
     No      2.250000  2.812500   18.420000
Sat  Yes     2.476190  2.875476   21.276667
     No      2.555556  3.102889   19.661778
Sun  Yes     2.578947  3.516842   24.120000
     No      2.929825  3.167895   20.506667

# CrossTab

* A cross-tabulation (or crosstab for short) is a special case of a pivot table that computes group frequencies.

In [126]:
pd.crosstab(tips.day, tips.smoker)

smoker  Yes  No
day
Thur     17  45
Fri      15   4
Sat      42  45
Sun      19  57

<center><h1><strong><font color="blue">End of Module</font></strong></h1></center>

<img alt="" src="images/meme-cartoon/data-wrangling-meme.jpg"/>

# Referensi:

1. Rattenbury, Tye, et al. Principles of data wrangling: Practical techniques for data preparation. " O'Reilly Media, Inc.", 2017.

2. McKinney, Wes. Python for data analysis: Data wrangling with Pandas, NumPy, and IPython. " O'Reilly Media, Inc.", 2012.